Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/local_and_regional_government/powers_of_local_authorities.html.txt.tmx
Source language: en
Languages: ga

source: There are a number of ways in which local authorities carry out their functions
ga: Tá bealaí éagsúla ina fheidhmíonn an t-údarás áitiúil

source: Some functions are carried out by the members of the authority acting as a body at meetings
ga: Cuirtear cuid dá dhualgais i bhfeidhm agus baill an údaráis ag gníomhú le chéile ag cruinnithe

source: Some functions are carried out by committees and some functions are carried out through the council's chief executive
ga: Comhlíonann coistí roinnt dualgas agus comhlíonann an príomhfheidhmeannach na comhairle dualgais eile

source: At council meetings, the council may pass resolutions, for example to introduce or change charges and rates
ga: D'fhéadfadh an Chomhairle rúin a ghlacadh ag cruinnithe den Chomhairle, mar shampla chun táillí agus rátaí a thabhairt isteach nó a athrú

source: The council can also pass Bye-Laws when it is in the interests of the common good of the community that an activity should be regulated or controlled
ga: D'fhéadfadh an Chomhairle fodhlíthe a chur i bhfeidhm más ar leas an phobail é gníomh ar leith a rialú nó a smachtú

source: It also has the power to make Bye-Laws to prevent or stop any nuisance in the area
ga: Tá an chumhacht aici chomh maith fodhlíthe a ghlacadh chun cosc nó stad a cur le núis sa cheantar

source: Local authorities frequently make Bye-Laws in relation to the control of parking, litter and animal control (specifically dog control and control of horses
ga: Is minic a dhéanann údaráis áitiúla fodhlíthe maidir le páirceáil, brúscar agus gadhair a smachtú

source: Two months before making a Bye-Law, the local authority must publish a notice in a newspaper circulating in the area to which the Bye-Law relates, indicating that it proposes to make the Bye-Law
ga: Dhá mhí roimh dó fodhlí a dhéanamh, ní foláir don údarás áitiúil fógra a fhoilsiú i nuachtán a dháilítear sa cheantar a bhaineann an fodhlí leis, ag rá go bhfuil sé i gceist aige an fodhlí a dhéanamh

source: The public is entitled to inspect the proposed Bye-Law and make submissions about it before it comes into effect
ga: Tá an ceart ag an bpobal an fodhlí atá molta a scrúdú agus a dtuairimí a nochtadh faoi, sula dtagann sé i bhfeidhm

source: If you wish to inspect a Bye-Law, you may do so during office hours at your local authority office
ga: Má tá tú ag iarraidh fodhlí a scrúdú d'fhéadfá é sin a dhéanamh laistigh d'uaireanta oibre ag oifig d'údarás áitiúil

source: There is no charge for inspection of the Bye-Law
ga: Níl táille ag baint le fodhlí a scrúdú

source: If you wish to obtain a copy of the Bye-Law, you may have to pay for the cost of copying it
ga: Ma tá tú ag iarraidh cóip den fhodhlí a fháil, d'fhéadfaí iarraidh ort íoc as costas a chóipeála

source: To inspect a Bye-Law, simply go to your local authority office and request the Bye-Law in question
ga: Chun fodhlí a scrúdú, d'fhéadfá dul chuig oifig d'údarás áitiúil agus iarratas a dhéanamh ar an bhfodhlí atá i gceist

source: You may also request a copy - you may be charged a reasonable fee for copying it
ga: D'fhéadfá iarratas a dhéanamh ar chóip de a fháil chomh maith - d'fhéadfaí táille réasúnta a ghearradh ort as an gcóipeáil

source: If you wish to make submissions on the Bye-Law, you may do so in writing
ga: Má tá tú ag iarraidh moltaí a dhéanamh faoin bhfodhlí, d'fhéadfá é sin a dhéanamh i scríbhinn

source: You must deliver your submissions to the local authority within the time limit
ga: Ní foláir duit do mholtaí a thabhairt don údarás áitiúil taobh istigh den teorainn ama

source: The time limit is specified by the local authority but it cannot be less than 7 days after the end of the period for inspection
ga: Leagann an t-údarás áitiúil síos an teorainn ama ach ní fhéadfadh sé a bheith níos lú ná seacht lá tar éis deiridh na tréimhse scrúdaithe
